{
  "profile": {
    "name": "Ali El-Sayed",
    "title": "Machine Learning & Software Engineer",
    "contact": {
      "email": "Ali-hisham@hotmail.com",
      "phone": "+971 58 631 3352",
      "location": "UAE · Dubai",
      "website": "https://asharp97.github.io",
      "linkedin": "https://www.linkedin.com/in/ali-elsayed-25974b130/"
    },
    "summary": "Results-driven Machine Learning Enthusiast and Frontend Developer with Full-Stack Capabilities, combining a strong engineering mindset with a passion for innovation. Skilled in leveraging machine learning and artificial intelligence to create intelligent, data-driven applications, alongside crafting user-friendly and scalable digital solutions. Committed to continuous learning, I deliver impactful results at the intersection of advanced analytics, technology, and design."
  },
  "skills": {
    "programming_languages": ["Python", "JavaScript", "TypeScript"],
    "frameworks": ["Nuxt.js", "Vue.js", "React.js"],
    "web_development": {
      "frontend": ["Responsive Web Design", "UI Design", "AJAX", "JSON"],
      "databases": ["SQL"]
    },
    "cloud_computing": {
      "platforms": ["Google Cloud Platform (GCP)"],
      "services": ["Vertex AI", "Kubernetes", "BigQuery"],
      "specializations": ["Cloud-based AI solutions"]
    },
    "artificial_intelligence_and_machine_learning": {
      "libraries_and_tools": ["TensorFlow", "Scikit-learn"],
      "techniques": ["Predictive Modeling", "Data Analysis"]
    }
  },
  "professional_experience": [
    {
      "role": "Founder",
      "company": "Quizly",
      "location": null,
      "period": "2024 – Present",
      "responsibilities": [
        "Founded and developed Quizly, a SaaS platform enabling users to create and take quizzes or surveys, collect responses, and visualize participant data through interactive graphs and analytics.",
        "Designed an intuitive and user-friendly interface, ensuring simplicity and accessibility while maintaining a professional and engaging user experience.",
        "Prioritized secure practices and performance optimization, employing minimal and efficient code to deliver a fast, reliable, and secure platform."
      ]
    },
    {
      "role": "Full Stack Developer",
      "company": "Ayhanlar Holding",
      "location": "Istanbul, Türkiye",
      "period": "2024 – Present",
      "responsibilities": [
        "Designed and developed projects under tight deadlines, achieving 92% SEO effectiveness, resulting in increased organic search traffic, while implementing interactive and requirement-based JavaScript features.",
        "Collaborated with teams and managed content workflows, overseeing design decisions, SEO practices, analytics reviews, and task assignments, while adapting to evolving requirements with efficient solutions.",
        "Handled deployment and infrastructure, selecting servers and ensuring smooth deployments, while effectively balancing technical responsibilities with team coordination and stakeholder presentations."
      ]
    },
    {
      "role": "Freelance Full Stack Developer",
      "company": "Landclub",
      "location": "Istanbul, Türkiye",
      "period": "2023 – 2023",
      "responsibilities": [
        "Optimized codebase for performance, achieving a Lighthouse score of 97 in Performance, 80 in Accessibility, and 100 in Best Practices, while minimizing the code footprint for maintainability and scalability.",
        "Collaborated with a designer to create a visually appealing project, incorporating modern design principles and interactive on-scroll animations to enhance user engagement and retention.",
        "Focused extensively on performance optimization, ensuring a seamless user experience by implementing efficient coding practices and attention to detail in UI/UX development."
      ]
    },
    {
      "role": "Web Developer",
      "company": "Hasel",
      "location": "Istanbul, Türkiye",
      "period": "2023 – 2024",
      "responsibilities": [
        "Collaborated with cross-functional teams to deliver responsive and user-friendly web projects, consistently meeting deadlines and establishing a strong professional foundation in software development.",
        "Conducted testing for web and mobile applications, identifying and resolving issues to ensure functionality, reliability, and seamless user experiences across devices.",
        "Focused on responsive design, ensuring projects were optimized for various screen sizes and devices, enhancing accessibility and user engagement."
      ]
    }
  ],
  "professional_certificates": [
    {
      "title": "Professional Machine Learning Engineer Certification",
      "issuer": "Google",
      "description": "Showcasing advanced expertise in designing, building, and deploying machine learning models."
    },
    {
      "title": "Google Cloud Console Skill Badges",
      "description": "Completed multiple GCP skill badges, including Data Engineering and Machine Learning Fundamentals, highlighting proficiency in leveraging cloud-based AI and data solutions."
    }
  ],
  "education": [
    {
      "degree": "Degree in Computer Engineering",
      "institution": "Doğuş University",
      "location": "Istanbul, Türkiye",
      "period": "2018 – 2022",
      "details": "Acquired fundamental knowledge of software engineering principles and practices."
    }
  ],
  "languages": ["English", "Arabic", "Turkish"],
  "links": {
    "Quizly": "https://quizly-app.tiiny.site/",
    "Ayhanlar Holding": "https://www.ayhanlar.com.tr/",
    "Landclub": "https://eksland.com/",
    "Hasel": "https://hasel.com/",
    "Doğuş University": "https://www.dogus.edu.tr/"
  }
}
